import { useState } from 'react';
import styles from './PasswordReset.module.scss';

export const PasswordReset = () => {
  const [firstStep, setFirstStep] = useState(false);
  const [secondStep, setSecondStep] = useState(false);
  const [thirdStep, setThirdStep] = useState(true);

  const [typeFirst, setTypeFirst] = useState('password');
  const [iconFirst, setIconFirst] = useState('eyeOff');

  const [typeSecond, setTypeSecond] = useState('password');
  const [iconSecond, setIconSecond] = useState('eyeOff');

  const handleTogglePasswordFirst = () => {
    if (typeFirst === 'password') {
      setIconFirst('eye');
      setTypeFirst('text');
    } else {
      setIconFirst('eyeOff');
      setTypeFirst('password');
    }
  };

  const handleTogglePasswordSecond = () => {
    if (typeSecond === 'password') {
      setIconSecond('eye');
      setTypeSecond('text');
    } else {
      setIconSecond('eyeOff');
      setTypeSecond('password');
    }
  };

  return (
    <div className={styles.reset}>
      {firstStep && (
        <form className={styles.resetForm}>
          <h3 className={styles.resetForm__title}>Восстановление доступа</h3>
          <p className={styles.resetForm__text}>
            Введите адрес электронной почты или номер телефона, связанный с
            вашей учетной записью для получения одноразового кода
          </p>
          <label className={styles.resetForm__email}>
            <input
              className={styles.resetForm__emailInput}
              type="text"
              placeholder="Email/телефон"
              required
            />
          </label>
          <button className={styles.resetForm__btn}>Продолжить</button>
        </form>
      )}
      {secondStep && (
        <form className={styles.resetForm}>
          <h3 className={styles.resetForm__title}>Восстановление доступа</h3>
          <p className={styles.resetForm__text}>
            Введите полученный код, чтобы продолжить
          </p>
          <label className={styles.resetForm__code}>
            <input
              className={styles.resetForm__codeInput}
              type="text"
              placeholder="Код"
              required
            />
          </label>
          <button className={styles.resetForm__btn}>Продолжить</button>
        </form>
      )}
      {thirdStep && (
        <form className={styles.resetForm}>
          <h3 className={styles.resetForm__title}>Восстановление доступа</h3>
          <p className={styles.resetForm__text}>Придумайте нновый пароль</p>
          <label className={styles.resetForm__password}>
            <input
              className={styles.resetForm__passwordInput}
              type={typeFirst}
              placeholder="Новый пароль"
              required
            />
            <div
              className={styles.resetForm__passwordEye}
              onClick={handleTogglePasswordFirst}
            >
              {iconFirst === 'eyeOff' && (
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.329 13.885L4.12 21.092C4.02775 21.1875 3.91741 21.2637 3.7954 21.3161C3.6734 21.3685 3.54218 21.3961 3.4094 21.3973C3.27662 21.3984 3.14494 21.3731 3.02205 21.3228C2.89915 21.2725 2.7875 21.1983 2.69361 21.1044C2.59971 21.0105 2.52546 20.8989 2.47518 20.776C2.4249 20.6531 2.3996 20.5214 2.40075 20.3886C2.4019 20.2558 2.42949 20.1246 2.4819 20.0026C2.53431 19.8806 2.61049 19.7703 2.706 19.678L10.03 12.354C9.97299 12.0365 9.99362 11.7099 10.0901 11.4021C10.1867 11.0943 10.3562 10.8144 10.5843 10.5863C10.8124 10.3582 11.0923 10.1887 11.4001 10.0921C11.7079 9.99562 12.0345 9.97499 12.352 10.032L19.679 2.706C19.8676 2.52385 20.1202 2.42305 20.3824 2.42533C20.6446 2.42761 20.8954 2.53278 21.0808 2.71819C21.2662 2.90359 21.3714 3.15441 21.3737 3.4166C21.376 3.6788 21.2752 3.9314 21.093 4.12L13.885 11.33C14.0123 11.6866 14.0358 12.072 13.9527 12.4413C13.8696 12.8107 13.6834 13.1489 13.4156 13.4166C13.1479 13.6844 12.8097 13.8706 12.4403 13.9537C12.0709 14.0368 11.6856 14.0123 11.329 13.885ZM18.869 7.758C20.75 8.842 22 10.34 22 12C22 15.314 17.042 17.993 12 18C10.974 17.9999 9.95075 17.8927 8.947 17.68L10.808 15.82C11.5048 16.0377 12.2479 16.0606 12.9568 15.8862C13.6657 15.7118 14.3133 15.3467 14.8295 14.8305C15.3457 14.3143 15.7108 13.6667 15.8852 12.9578C16.0596 12.2489 16.0367 11.5058 15.819 10.809L18.869 7.758ZM14.709 6.262L12.875 8.096C12.217 7.9483 11.5323 7.96934 10.8847 8.15719C10.237 8.34504 9.6473 8.69359 9.17044 9.17045C8.69359 9.6473 8.34504 10.237 8.15719 10.8847C7.96934 11.5323 7.94829 12.217 8.096 12.875L4.869 16.1C3.134 15.028 2 13.585 2 12C2 8.686 6.984 5.983 12 6C12.914 6.003 13.827 6.094 14.709 6.262Z"
                    fill="#34856D"
                  />
                </svg>
              )}
              {iconFirst === 'eye' && (
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M12.0618 18.0743C6.98865 18.0813 2 15.3717 2 12.0372C2 8.70269 7.01482 5.98298 12.0618 6.00008C17.1088 6.01719 22.1237 8.70269 22.1237 12.0372C22.1237 15.3717 17.135 18.0672 12.0618 18.0743ZM12.0618 16.0619C13.1293 16.0619 14.153 15.6379 14.9077 14.8831C15.6625 14.1283 16.0866 13.1046 16.0866 12.0372C16.0866 10.9698 15.6625 9.94605 14.9077 9.19126C14.153 8.43648 13.1293 8.01245 12.0618 8.01245C10.9944 8.01245 9.9707 8.43648 9.21591 9.19126C8.46113 9.94605 8.0371 10.9698 8.0371 12.0372C8.0371 13.1046 8.46113 14.1283 9.21591 14.8831C9.9707 15.6379 10.9944 16.0619 12.0618 16.0619ZM12.0618 14.0495C11.5281 14.0495 11.0163 13.8375 10.6389 13.4601C10.2615 13.0827 10.0495 12.5709 10.0495 12.0372C10.0495 11.5035 10.2615 10.9916 10.6389 10.6142C11.0163 10.2368 11.5281 10.0248 12.0618 10.0248C12.5955 10.0248 13.1074 10.2368 13.4848 10.6142C13.8622 10.9916 14.0742 11.5035 14.0742 12.0372C14.0742 12.5709 13.8622 13.0827 13.4848 13.4601C13.1074 13.8375 12.5955 14.0495 12.0618 14.0495Z"
                    fill="#34856D"
                  />
                </svg>
              )}
            </div>
          </label>
          <label className={styles.resetForm__password}>
            <input
              className={styles.resetForm__passwordInput}
              type={typeSecond}
              placeholder="Подтверждение пароля"
              required
            />
            <div
              className={styles.resetForm__passwordEye}
              onClick={handleTogglePasswordSecond}
            >
              {iconSecond === 'eyeOff' && (
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.329 13.885L4.12 21.092C4.02775 21.1875 3.91741 21.2637 3.7954 21.3161C3.6734 21.3685 3.54218 21.3961 3.4094 21.3973C3.27662 21.3984 3.14494 21.3731 3.02205 21.3228C2.89915 21.2725 2.7875 21.1983 2.69361 21.1044C2.59971 21.0105 2.52546 20.8989 2.47518 20.776C2.4249 20.6531 2.3996 20.5214 2.40075 20.3886C2.4019 20.2558 2.42949 20.1246 2.4819 20.0026C2.53431 19.8806 2.61049 19.7703 2.706 19.678L10.03 12.354C9.97299 12.0365 9.99362 11.7099 10.0901 11.4021C10.1867 11.0943 10.3562 10.8144 10.5843 10.5863C10.8124 10.3582 11.0923 10.1887 11.4001 10.0921C11.7079 9.99562 12.0345 9.97499 12.352 10.032L19.679 2.706C19.8676 2.52385 20.1202 2.42305 20.3824 2.42533C20.6446 2.42761 20.8954 2.53278 21.0808 2.71819C21.2662 2.90359 21.3714 3.15441 21.3737 3.4166C21.376 3.6788 21.2752 3.9314 21.093 4.12L13.885 11.33C14.0123 11.6866 14.0358 12.072 13.9527 12.4413C13.8696 12.8107 13.6834 13.1489 13.4156 13.4166C13.1479 13.6844 12.8097 13.8706 12.4403 13.9537C12.0709 14.0368 11.6856 14.0123 11.329 13.885ZM18.869 7.758C20.75 8.842 22 10.34 22 12C22 15.314 17.042 17.993 12 18C10.974 17.9999 9.95075 17.8927 8.947 17.68L10.808 15.82C11.5048 16.0377 12.2479 16.0606 12.9568 15.8862C13.6657 15.7118 14.3133 15.3467 14.8295 14.8305C15.3457 14.3143 15.7108 13.6667 15.8852 12.9578C16.0596 12.2489 16.0367 11.5058 15.819 10.809L18.869 7.758ZM14.709 6.262L12.875 8.096C12.217 7.9483 11.5323 7.96934 10.8847 8.15719C10.237 8.34504 9.6473 8.69359 9.17044 9.17045C8.69359 9.6473 8.34504 10.237 8.15719 10.8847C7.96934 11.5323 7.94829 12.217 8.096 12.875L4.869 16.1C3.134 15.028 2 13.585 2 12C2 8.686 6.984 5.983 12 6C12.914 6.003 13.827 6.094 14.709 6.262Z"
                    fill="#34856D"
                  />
                </svg>
              )}
              {iconSecond === 'eye' && (
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M12.0618 18.0743C6.98865 18.0813 2 15.3717 2 12.0372C2 8.70269 7.01482 5.98298 12.0618 6.00008C17.1088 6.01719 22.1237 8.70269 22.1237 12.0372C22.1237 15.3717 17.135 18.0672 12.0618 18.0743ZM12.0618 16.0619C13.1293 16.0619 14.153 15.6379 14.9077 14.8831C15.6625 14.1283 16.0866 13.1046 16.0866 12.0372C16.0866 10.9698 15.6625 9.94605 14.9077 9.19126C14.153 8.43648 13.1293 8.01245 12.0618 8.01245C10.9944 8.01245 9.9707 8.43648 9.21591 9.19126C8.46113 9.94605 8.0371 10.9698 8.0371 12.0372C8.0371 13.1046 8.46113 14.1283 9.21591 14.8831C9.9707 15.6379 10.9944 16.0619 12.0618 16.0619ZM12.0618 14.0495C11.5281 14.0495 11.0163 13.8375 10.6389 13.4601C10.2615 13.0827 10.0495 12.5709 10.0495 12.0372C10.0495 11.5035 10.2615 10.9916 10.6389 10.6142C11.0163 10.2368 11.5281 10.0248 12.0618 10.0248C12.5955 10.0248 13.1074 10.2368 13.4848 10.6142C13.8622 10.9916 14.0742 11.5035 14.0742 12.0372C14.0742 12.5709 13.8622 13.0827 13.4848 13.4601C13.1074 13.8375 12.5955 14.0495 12.0618 14.0495Z"
                    fill="#34856D"
                  />
                </svg>
              )}
            </div>
          </label>
          <button className={styles.resetForm__btn}>Продолжить</button>
        </form>
      )}
    </div>
  );
};
